## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["talos-testing-cp01.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/103"
        name                   = "talos-testing-cp01"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["talos-testing-cp02.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/115"
        name                   = "talos-testing-cp02"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["talos-testing-cp03.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/104"
        name                   = "talos-testing-cp03"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["talos-testing-w01.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/114"
        name                   = "talos-testing-w01"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["talos-testing-w02.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/113"
        name                   = "talos-testing-w02"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["talos-testing-w03.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/102"
        name                   = "talos-testing-w03"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  